Tekla Open API Reference for Tekla Structures 2025
WeldMark.Attributes Property
 The attributes of the weld mark. For more information see WeldMark.WeldMarkAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WeldMark.WeldMarkAttributes Attributes { get; set; }
Public Property Attributes As WeldMark.WeldMarkAttributes
	Get
	Set
Property Value
Type: WeldMark.WeldMarkAttributes
See Also
Reference
WeldMark Class
Tekla.Structures.Drawing Namespace